create database classmates;
use classmates;

create table people
(
	id INT primary key auto_increment, 
    FirstName varchar(20) NOT null,
    LastName varchar(20) NOT null, 
    age tinyint NOT null, 
    address varchar(250) NOT null
);

insert into people(id, FirstName, LastName, age, address)
value
(0001, "Злата", "Семёнова", 42 , "676275, г. Саранск, ул. Мжд Киевское 2-й км, дом 87, квартира 273"),
(0002, "Анжела", "Пугачева", 28 , "185961, г. Караблино, ул. Парковая 3-я, дом 114, квартира 111"),
(0003, "Глафира", "Меркулова", 48 , "394086, г. Железногорск-Илимский, ул. Пинский пер, дом 119, квартира 19"),
(0004, "Сигизмунд", "Щербаков", 26 , "607621, г. Архонская, ул. Ласточкина, дом 172, квартира 270"),
(0005, "Натан", "Охота", 22 , "617105, г. Зилаир, ул. 60-летия Октября пр-кт, дом 146, квартира 948"),
(0006, "Ипатий", "Сергеев", 36 , "632415, г. Средняя Ахтуба, ул. Выползов пер, дом 73, квартира 320"),
(0007, "Полина", "Руденко", 18 , "Тучковская ул., Москва, 121087"),
(0008, "Мстислава", "Охотникова", 25 , "Беговая ул., Москва, 125284"),
(0009, "Агриппина", "Берестова", 30 , "ул. Верземнека, 6, Москва, 129272");

select FirstName from people
where address regexp 'Москва' and age >= 18 and age < 30;

